
Задание 1
=========

Описание задания
Напишите программу на языке Ruby, которая выполняет следующие задачи:
Запрашивает у пользователя три числа и сохраняет их в массив.
Сравнивает каждое число с числом 10 и выводит сообщение, больше ли оно, меньше или равно 10.
Запрашивает у пользователя еще одно число и добавляет его в массив.
Сортирует массив по возрастанию и выводит отсортированный массив.
Вычисляет и выводит сумму всех чисел в массиве.
Находит и выводит максимальное и минимальное значение в массиве.

Пример выполнения
Программа должна работать следующим образом:

Введите первое число: 8
Введите второе число: 15
Введите третье число: 7
Число 8 меньше 10
Число 15 больше 10
Число 7 меньше 10
Введите еще одно число: 12
Отсортированный массив: [7, 8, 12, 15]
Сумма всех чисел: 42
Максимальное значение: 15
Минимальное значение: 7


Задание 2
=========

Описание задания
Напишите программу на языке Ruby, которая выполняет следующие задачи:
Запрашивает у пользователя пять слов и сохраняет их в массив.
Сравнивает каждое слово с длиной 5 символов и выводит сообщение, больше ли оно, меньше или равно 5 символам.
Запрашивает у пользователя еще одно слово и добавляет его в массив.
Сортирует массив по алфавиту и выводит отсортированный массив.
Находит и выводит самое длинное и самое короткое слово в массиве.
Использует цикл для вывода каждого слова в массиве с указанием его индекса.

Пример выполнения
Программа должна работать следующим образом:

Введите первое слово: привет
Введите второе слово: мир
Введите третье слово: руби
Введите четвертое слово: программирование
Введите пятое слово: код
Слово 'привет' больше 5 символов
Слово 'мир' меньше 5 символов
Слово 'руби' меньше 5 символов
Слово 'программирование' больше 5 символов
Слово 'код' меньше 5 символов
Введите еще одно слово: алгоритм
Отсортированный массив: ["алгоритм", "код", "мир", "привет", "программирование", "руби"]
Самое длинное слово: программирование
Самое короткое слово: мир
Слова в массиве:
0: алгоритм
1: код
2: мир
3: привет
4: программирование
5: руби
