
Задание 1
=========

Описание задания
Напишите программу на языке Ruby, которая выполняет следующие задачи:
Запрашивает у пользователя его имя и текущий возраст.
Рассчитывает, сколько лет пользователю будет через 10 лет.
Запрашивает у пользователя его любимый цвет и выводит сообщение, сколько букв в этом цвете.
Запрашивает у пользователя его рост в сантиметрах и переводит его в метры.
Запрашивает у пользователя любое предложение и выводит его в обратном порядке.
Выводит итоговое сообщение, содержащее всю информацию, используя интерполяцию строк.

Пример выполнения
Программа должна работать следующим образом:

Введите ваше имя: Мария
Введите ваш возраст: 20
Введите ваш любимый цвет: синий
Введите ваш рост в сантиметрах: 165
Введите любое предложение: Я люблю программировать
Через 10 лет вам будет 30 лет.
В вашем любимом цвете 5 букв.
Ваш рост в метрах: 1.65
Ваше предложение в обратном порядке: ьтиравмаргорп юбил я
Итог: Мария, вам сейчас 20 лет. Через 10 лет вам будет 30 лет. Ваш любимый цвет — синий, и в нем 5 букв. Ваш рост в метрах: 1.65. Вы сказали: "Я люблю программировать" в обратном порядке.


Задание 2
=========

Описание задания
Напишите программу на языке Ruby, которая выполняет следующие задачи:
Запрашивает у пользователя его имя и количество лет, которые он уже прожил.
Вычисляет, сколько дней он прожил (предполагая, что в году 365 дней).
Запрашивает у пользователя любимую книгу и выводит, сколько слов в названии этой книги.
Запрашивает у пользователя его вес в килограммах и переводит его в граммы.
Запрашивает у пользователя его любимую цитату и выводит количество символов в этой цитате.
Выводит итоговое сообщение, содержащее всю информацию, используя интерполяцию строк.

Пример выполнения
Программа должна работать следующим образом:

Введите ваше имя: Дмитрий
Сколько лет вы уже прожили: 30
Введите вашу любимую книгу: Война и мир
Введите ваш вес в килограммах: 75
Введите вашу любимую цитату: Не имей сто рублей, а имей сто друзей
Вы прожили 10950 дней.
В названии вашей любимой книги 3 слов.
Ваш вес в граммах: 75000
В вашей любимой цитате 36 символов.
Итог: Дмитрий, вы прожили 30 лет, что составляет 10950 дней. Ваша любимая книга — "Война и мир", и в ее названии 3 слова. Ваш вес составляет 75000 граммов. Ваша любимая цитата: "Не имей сто рублей, а имей сто друзей" имеет 36 символов.
